[{"id":"e1","title":"SeaPHP Pre Meeting Social","abstract":"Plenty of time to take your coat off, get comfortable, and get to know some friendly developers. We meet in a large space with plenty of seating, a serving area for refreshments, and accessible restrooms when you need to freshen up. There will be plenty of appetizers to nosh on, and plenty of awesome people to hang out with.","type":null,"presenter":[],"category":"Sep 06 Wed","session_type":null,"experience_level":null,"room":"WeWork Holyoke Building 107 Spring St, Seattle","date":"2017-09-06","start":"2017-09-06 18:00","end":"2017-09-06 19:00"},{"id":"e2","title":"SeaPHP Presentations","abstract":"Our special pre-conference meetup will feature two presentations - one from a conference speaker guest, and one from our own Andrew Baker. It's a casual environment so you can expect to have plenty of opportunities to ask questions and to talk about your own projects. Some time is set aside at each meeting for attendees to announce if they are hiring developers or are a developer looking for their next role.","type":null,"presenter":[],"category":"Sep 06 Wed","session_type":null,"experience_level":null,"room":"WeWork Holyoke Building 107 Spring St, Seattle","date":"2017-09-06","start":"2017-09-06 19:00","end":"2017-09-06 20:30"},{"id":"e3","title":"SeaPHP After Meeting Social","abstract":"After our presentations have wrapped up everyone is welcome to join us at a nearby restaurant for food, drink, and great conversation. ","type":null,"presenter":[],"category":"Sep 06 Wed","session_type":null,"experience_level":null,"room":"To Be Announced","date":"2017-09-06","start":"2017-09-06 20:30","end":"2017-09-06 22:00"},{"id":"t1","title":"Build a Bot","abstract":"Think you can do better than Google Assistant, Alexa, or Siri? Want to build your own intelligent Facebook Messenger bot? Dipping your toe into the water is easier than you think, thanks to tools like API.ai and Google's Cloud Speech API. We'll start by building a chat bot that can keep track of context from message to message. Then we'll mix in speech input and output to get something a little closer to your favorite assistant app.","type":"workshop","presenter":[{"id":8,"fullname":"Ian Littman","twitter":"iansltx","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/fc6bea5fbcfedd0f991291b565a10fa8.jpeg","bio":"When he isn't building or maintaining web applications, primarily of the API variety, for a handful of clients, Ian's probably biking between coffee shops in Austin, Texas or bemoaning the fact that \"artificial intelligence\" is now merely a marketing term. He also helps organize the Austin PHP user group and the ATX Web Lunch, the latter of which is basically an excuse to grab tasty tacos while talking tech a few times per month.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 07 Thu","session_type":"Workshop","experience_level":"intermediate","room":"Johnson Hall room 111","date":"2017-09-07","start":"2017-09-07 09:00","end":"2017-09-07 10:45"},{"id":"t3","title":"Becoming an Open Source Contributor","abstract":"Are you interested in contributing to an open source project but aren't sure where to get started? Have you tried to contribute but gave up trying to figure out the contribution process? This tutorial will walk you through the contribution process and the tools you need to make contributions to popular open source projects. Bring your laptop, because we won't just be talking about contributions, you will actually make a contribution during this tutorial. Come to the talk a developer; leave as an open source contributor!","type":"workshop","presenter":[{"id":13,"fullname":"Beth Tucker Long","twitter":"e3betht","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/d8c917d7661e983b97171d9ec87f78e4.png","bio":"Beth Tucker Long is a PHP developer and co-organizer of (Madison PHP). You can find her on Twitter (@e3betht) or on her blog (http:\/\/www.alittleofboth.com). Beth is a firm believer in promoting community and mentoring. She runs Treeline Design, a web development company, and Playlist Event Music, a DJ company, along with her husband, Chris.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 07 Thu","session_type":"Workshop","experience_level":"beginner","room":"Johnson Hall room 178","date":"2017-09-07","start":"2017-09-07 09:00","end":"2017-09-07 10:45"},{"id":"e4","title":"Lunch Thursday","abstract":"mmmmmmm, food for hungry developers. nomnomnom yum.","type":null,"presenter":[],"category":"Sep 07 Thu","session_type":null,"experience_level":null,"room":"To Be Announced","date":"2017-09-07","start":"2017-09-07 11:00","end":"2017-09-07 12:15"},{"id":"t4","title":"Demystifying Object-Oriented Programming","abstract":"Abstraction, Encapsulation, Polymorphism, Interfaces and Namespacing: whether you’ve been programming in PHP for years or are just starting your journey, these terms can be overwhelming. Learn what it take to be a \"modern\" PHP developer with real life examples of Object-Oriented terminology that will give you the experience to get your hands dirty.","type":"workshop","presenter":[{"id":3,"fullname":"Alena Holligan","twitter":"sketchings","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/6faf4a154f2e3f7adc98df6e715509c1.jpeg","bio":"Wife, Mother, Programer, Designer, Teacher, Leader. Bringing over 15 years of PHP experience into her Teaching at Treehouse and leading the Portland PHP users group. She is passionate about helping people overcome their own barriers to excellence in order to achieve personal confidence in their ability to learn and succeed.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 07 Thu","session_type":"Workshop","experience_level":"intermediate","room":"Johnson Hall room 111","date":"2017-09-07","start":"2017-09-07 12:30","end":"2017-09-07 14:30"},{"id":"t6","title":"Let Your Tests Drive Your Development","abstract":"Test driven development (TDD) is still a subject all developers agree upon it's a great thing, but never get around to actually do it for many reasons. In this workshop I use real world business requirements on legacy code for which we need to fix bugs and add features, but we're doing it in a TDD way. No matter if you're already a testing veteran or a junior developer just started working yesterday, this workshop will give you the skills and passion to continue your career as a Test Driven Developer. BONUS: We also cover the test migrations required to move from PHP 5.x to PHP 7.x!","type":"workshop","presenter":[{"id":4,"fullname":"Michelangelo van Dam","twitter":"DragonBe","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/d6fcc1ca101611755e235fbf79b28719.jpeg","bio":"Michelangelo is a veteran PHP consultant working at in2it, community leader for PHPBenelux, coach & mentor for kids at CoderDojo and a global conference speaker. Get him a coffee and he will tell you all about testing, continuous deployments, cloud or community work.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 07 Thu","session_type":"Workshop","experience_level":"intermediate","room":"Johnson Hall room 178","date":"2017-09-07","start":"2017-09-07 12:30","end":"2017-09-07 14:30"},{"id":"e7","title":"Break Thursday","abstract":"Free time! Refill your coffee. Grab a snack. Visit with vendors, speakers, and attendees. Decompress. Self care time.","type":null,"presenter":[],"category":"Sep 07 Thu","session_type":null,"experience_level":null,"room":"Johnson Hall","date":"2017-09-07","start":"2017-09-07 14:30","end":"2017-09-07 15:00"},{"id":"e19","title":"Break Thursday ","abstract":"Free time! Refill your coffee. Grab a snack. Visit with vendors, speakers, and attendees. Decompress. Self care time.","type":null,"presenter":[],"category":"Sep 07 Thu","session_type":null,"experience_level":null,"room":"To Be Announced","date":"2017-09-07","start":"2017-09-07 14:30","end":"2017-09-07 15:00"},{"id":"t10","title":"Microservices: The Strangler Pattern","abstract":"How do you upgrade a legacy application without attempting a full rewrite? Our large PHP application at InboxDollars works well and generates revenue. Unfortunately, we're locked into an old version of CakePHP. Rather than rewriting the ancient beast, we created a way to write new feature code using modern PHP while leaving our main application intact. We follow the Strangler Pattern using microservices. In this tutorial we learn: How the Strangler Pattern works Producer\/Consumer programming using microservices Criteria for identifying your Strangler Pattern candidates Structuring your code with an eye to future change Our example uses CakePHP and RabbitMQ. It's based on our experience at InboxDollars, but we focus on principles that apply to any language or framework.","type":"workshop","presenter":[{"id":6,"fullname":"Edward Barnard","twitter":"ewbarnard","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/cc7fb0c31c0bbb3e10839b90532db3a9.jpeg","bio":"Ed Barnard had a front-row seat when the Morris Worm took down the Internet, November 1988. He was teaching CRAY-1 supercomputer operating system internals to analysts as they were being directly hit by the Worm. It was a busy week! Ed continues to indulge his interests in computer security and teaching software concepts to others.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 07 Thu","session_type":"Workshop","experience_level":"beginner","room":"Johnson Hall room 111","date":"2017-09-07","start":"2017-09-07 15:00","end":"2017-09-07 17:00"},{"id":"t7","title":"Practical PHP Deployment with Jenkins","abstract":"Developers would love to \"automate all the things\", but where do we start? What tools exist for automating? And what can actually be automated? If we don't have unit tests can we still benefit from deployment automation? Adam Culp will show how a PHP application pulled from git, complete with unit tests, Composer dependency management, and package creation, can be deployed flawlessly using Jenkins. Then see how \"Dev\" and \"Ops\" are supported by a system if the application breaks through automated rollbacks.","type":"workshop","presenter":[{"id":2,"fullname":"Adam Culp","twitter":"adamculp","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/949ae4898f34b986b41e13b4065644db.jpeg","bio":"Adam Culp (@AdamCulp) a Zend consultant at Rogue Wave Software, is passionate about developing with PHP and contributes to many open source projects. He organizes the SunshinePHP Developer Conference and the South Florida PHP Users Group (SoFloPHP) where he enjoys helping others write good code, implement standards, and refactor efficiently. He is a Zend Certified PHP engineer, is a voting member of the PHP-Fig, and holds a seat on the Zend Certification Advisory Board. You can also find him on his Run Geek Radio podcast and GeekyBoy technical blog. When he is not coding or contributing to various developer communities, he can be found hiking around the U.S. National Parks, teaching judo, or long distance (ultra) running.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 07 Thu","session_type":"Workshop","experience_level":"beginner","room":"Johnson Hall room 178","date":"2017-09-07","start":"2017-09-07 15:00","end":"2017-09-07 17:00"},{"id":"e10","title":"Welcome! ","abstract":"Tessa Mero, co organizer of Pacific Northwest PHP, opens the main event with an introduction of things to come and a warm welcome to attendees.","type":null,"presenter":[],"category":"Sep 08 Fri","session_type":null,"experience_level":null,"room":"Main Event Room @ Kane Hall","date":"2017-09-08","start":"2017-09-08 09:00","end":"2017-09-08 09:15"},{"id":"t11","title":"Using Our Superpowers For Good","abstract":"Technology has snuck into nearly every part of our lives, from electronic medical records to online bill-pay systems to apps that remember which craft beers you’ve tasted. We usually think of this technology as a tool, something as indifferent as a hammer or a ruler. But in a world where algorithms decide which version of the news you read or when you should turn left, pretending our software is detached is naive—or even dangerous. So, when so few technologists (that’s us) are creating software for use by so many (that’s nearly everyone else in the world), how can we do right by them? What responsibility do we have to use our skills for good? And how can we get this right when humans beings insist on being so varied and complicated and, well… human?","type":"keynote","presenter":[{"id":14,"fullname":"Eryn O'Neil","twitter":"eryno","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/c2f1024d95540208df7a17c74e283615.jpeg","bio":"Eryn O’Neil is an independent PHP developer and tech lead based in Minneapolis, MN. Coming from the agency world, she has worked on everything from e-commerce and online promotions to a proprietary framework and CMS. Her philosophy is to build software by placing humans first: both the people who will use it and the developers who will build it with you (and maintain it afterward). \r\n\r\nLiving in Minnesota, Eryn spends most of her free time teaching blues dancing, flying on a trapeze, and wishing it weren’t snowing.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Keynote","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 09:15","end":"2017-09-08 10:00"},{"id":"t12","title":"Status Change: Now Using Event Sourcing","abstract":"Being flexible to changes in business process makes our jobs easier, and it helps our applications adapt to those changes with minimal code changes. One of the biggest adaptions in our applications has been the addition of Event Sourcing to make a note of an Event that happened in the system. With these Events, we can affect change immediately, or even later. This is most helpful in our reporting interfaces. We can build, change, and throw away our reports very easily. This is much easier than our older reports being generated by large SQL queries. Attendees will learn: - idealogical differences between status flags and events - triggering events in your application - handling events to reflect the state of your application data - building reports from events that are easy to change","type":"talk","presenter":[{"id":11,"fullname":"Emily Stamey","twitter":"elstamey","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/76f6cd8a46e6102857bb364e052aea50.jpeg","bio":"Emily Stamey works at InQuest, a network security company based in Washington, DC. She learned PHP in 1999 and loved it. This ignited her passion for Open Source! In her free time she enjoys music, legos, making things, playing games, and socializing. She is an active volunteer in the community as Director of Women Who Code Raleigh\/Durham, Organizer of TrianglePHP, and volunteers for Girl Develop It. She enjoys helping people share ideas and learn together, which has led to her speaking at conferences.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Talk","experience_level":"intermediate","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 10:00","end":"2017-09-08 10:45"},{"id":"t5","title":"Let's Talk Scope","abstract":"Scope is a major factor in any application, from programing scope to project scope, and communication is key. We will discuss different application scopes including global, functional, class, and package scope. From there we will show how everything ties together with communication of the project itself. Why and how to stay on top of project scope and how that can make or break the final outcome.","type":"talk","presenter":[{"id":3,"fullname":"Alena Holligan","twitter":"sketchings","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/6faf4a154f2e3f7adc98df6e715509c1.jpeg","bio":"Wife, Mother, Programer, Designer, Teacher, Leader. Bringing over 15 years of PHP experience into her Teaching at Treehouse and leading the Portland PHP users group. She is passionate about helping people overcome their own barriers to excellence in order to achieve personal confidence in their ability to learn and succeed.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Talk","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 11:00","end":"2017-09-08 11:45"},{"id":"e13","title":"Lunch Friday","abstract":"mmmmmmm food for hungry developers. nomnomnom yum.","type":null,"presenter":[],"category":"Sep 08 Fri","session_type":null,"experience_level":null,"room":"Kane Hall","date":"2017-09-08","start":"2017-09-08 12:00","end":"2017-09-08 13:15"},{"id":"t9","title":"Open Source","abstract":"Open sourced","type":"panel","presenter":[{"id":10,"fullname":"Margaret Staples","twitter":"dead_lugosi","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/11e3eceb6a792b71ee3ecdc3255dedce.png","bio":"Delighted Developer Evangelist @ Twilio. Proud keeper of best pupper ever, Lilith. Personally responsible sentient creature. Cybae. Consistent producer of code, philosophy, and attitude. Happy to help with all things Twilio. Let's make neat stuff.","jobtitle":null,"organization":null,"interests":null},{"id":12,"fullname":"Sammy Kaye Powers","twitter":"SammyK","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/5a91d4eb0935b531e2b4a0dbb9a1a432.jpeg","bio":"Sammy Kaye Powers has been making things on the web for fifteen years. Sammy spends the bulk of his time in coffee shops cranking out loads of Facebook apps for ad agencies. He dabbles in PHP internals and is the maintainer of the official Facebook PHP SDK. He loves sharing knowledge about Facebook development & PHP at SammyK.me. He co-organizes the Chicago PHP user group and hosts the PHP Roundtable podcast. He travels all over the States competing in a dance called West Coast Swing. He's also a volunteer magician performing bedside magic at children's hospitals.","jobtitle":null,"organization":null,"interests":null},{"id":9,"fullname":"Sara Golemon","twitter":"SaraMG","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/a243a5c3b3c51fde4371aa685a455017.jpeg","bio":"Sara is a long time contributor to the PHP language and runtime, HHVM Hacker, author of Extending and Embedding PHP, and PHP FIG Core Committee member.","jobtitle":null,"organization":null,"interests":null},{"id":11,"fullname":"Emily Stamey","twitter":"elstamey","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/76f6cd8a46e6102857bb364e052aea50.jpeg","bio":"Emily Stamey works at InQuest, a network security company based in Washington, DC. She learned PHP in 1999 and loved it. This ignited her passion for Open Source! In her free time she enjoys music, legos, making things, playing games, and socializing. She is an active volunteer in the community as Director of Women Who Code Raleigh\/Durham, Organizer of TrianglePHP, and volunteers for Girl Develop It. She enjoys helping people share ideas and learn together, which has led to her speaking at conferences.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Panel","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 13:30","end":"2017-09-08 14:15"},{"id":"t13","title":"Let's Get Random: Under the Hood of PHP 7's CSPRNG","abstract":"Randomness is really important in many cryptographic contexts. Unfortunately true randomness is a non-trivial achievement for computers. In fact, using weak sources of randomness can leave your application open to myriad vulnerabilities. Enter: a good cryptographically secure pseudorandom number generator (CSPRNG). We'll discuss the importance of using good sources of randomness, the CSPRNG options we had in PHP 5.x, and how the new-hotness CSPRNG functions in PHP 7 work under the hood.","type":"talk","presenter":[{"id":12,"fullname":"Sammy Kaye Powers","twitter":"SammyK","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/5a91d4eb0935b531e2b4a0dbb9a1a432.jpeg","bio":"Sammy Kaye Powers has been making things on the web for fifteen years. Sammy spends the bulk of his time in coffee shops cranking out loads of Facebook apps for ad agencies. He dabbles in PHP internals and is the maintainer of the official Facebook PHP SDK. He loves sharing knowledge about Facebook development & PHP at SammyK.me. He co-organizes the Chicago PHP user group and hosts the PHP Roundtable podcast. He travels all over the States competing in a dance called West Coast Swing. He's also a volunteer magician performing bedside magic at children's hospitals.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Talk","experience_level":"intermediate","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 14:30","end":"2017-09-08 15:15"},{"id":"e15","title":"Break Friday","abstract":"Free time! Refill your coffee. Grab a snack. Visit with vendors, speakers, and attendees. Decompress. Self care time.","type":null,"presenter":[],"category":"Sep 08 Fri","session_type":null,"experience_level":null,"room":"Kane Hall","date":"2017-09-08","start":"2017-09-08 15:15","end":"2017-09-08 15:45"},{"id":"t15","title":"How PHP ticks","abstract":"A look into the internals of PHP; How it came to be, how it works, and how PHP 7 leapt far out in front of its predecessor on performance and memory consumption with some thoughts on what's next for PHP 8.","type":"talk","presenter":[{"id":9,"fullname":"Sara Golemon","twitter":"SaraMG","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/a243a5c3b3c51fde4371aa685a455017.jpeg","bio":"Sara is a long time contributor to the PHP language and runtime, HHVM Hacker, author of Extending and Embedding PHP, and PHP FIG Core Committee member.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Talk","experience_level":"advanced","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 15:45","end":"2017-09-08 16:30"},{"id":"t22","title":"Modern and Secure PHP","abstract":"This is not the PHP of old. Learn what's changed in the PHP world over the last few years. Classes, objects, statics, traits, unit testing, composer, password hashing; it's a whole new ballgame. Learn what has changed in the PHP world over the last several years. We'll cover The newest PHP language features. Community efforts such as the PHP Framework Interoperability Group, Composer, and PHP the Right Way. How to secure your application using up to date techniques.","type":"talk","presenter":[{"id":5,"fullname":"Ben Edmunds","twitter":"benedmunds","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/72b23620824c727d6c543c60605bac1b.jpeg","bio":"CTO of an awesome company you've never heard of by day, hacking on crazy ideas by night. PHP Town Hall podcast co-host. Author of Securing PHP Apps. Conference speaker. Open source advocate. Human.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 08 Fri","session_type":"Talk","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-08","start":"2017-09-08 16:45","end":"2017-09-08 17:30"},{"id":"e11","title":"Closing Friday","abstract":"Tessa Mero wraps up day one!","type":null,"presenter":[],"category":"Sep 08 Fri","session_type":null,"experience_level":null,"room":"Main Event Room @ Kane Hall","date":"2017-09-08","start":"2017-09-08 17:30","end":"2017-09-08 18:00"},{"id":"e12","title":"Pacific Northwest PHParty!","abstract":"More details coming soon!","type":null,"presenter":[],"category":"Sep 08 Fri","session_type":null,"experience_level":null,"room":"To Be Announced","date":"2017-09-08","start":"2017-09-08 18:30","end":"2017-09-08 21:30"},{"id":"t20","title":"Making more human interfaces using Machine Learning APIs","abstract":"In order to understand interfaces, humans need information and context. You can't always provide that. But machines can by comparing what you have with trillions of other, similar datasets on the web. Using Machine Learning, Deep Learning and Artificial Intelligence you can roll interfaces that not only have what your user gave you, but enhance it with important meta data to make it more usable. In this talk you'll learn about APIs to use to turn images and video into text, to find people in photos, to know the emotions of people in photos, to allow for human input into digital interfaces and to prevent unwanted content to enter your products. You don't need to be a data scientist to do this, you can tap into already existing offers for you.","type":"keynote","presenter":[{"id":1,"fullname":"Chris Heilmann","twitter":"codepo8","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/67c01b261954a5435facb8e4244a1c82.jpeg","bio":"Chris has dedicated a lot of time to making the web better. Originally in radio journalism, he built his first site around 1997 and spent following years working on large, international sites. He spent a few years in Yahoo building products and training people including Yahoo Answers, Search, Local and Maps. He worked at Mozilla moving HTML5 support forward and advocating Firefox OS as an open alternative to closed mobile systems. Chris wrote two and contributed to eight books on web development and wrote many articles and hundreds of blog posts for Ajaxian, Smashing Magazine, Yahoo, Mozilla, ScriptJunkie and more. He wrote the Developer Evangelism Handbook many companies use to coach evangelists. He currently works with the Microsoft Edge team as a Program Manager for Developer Outreach.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Keynote","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 09:00","end":"2017-09-09 09:45"},{"id":"t14","title":"Bringing Old Legacy Apps To PHP 7 and Beyond","abstract":"Most developers don't get the luxury of working on a greenfield project using a web framework of their choice. Often times we find ourselves inheriting a legacy codebase written years ago for an end-of-life version of PHP and a now-defunct web framework. The initial temptation might be, \"I'll just rewrite all this on x framework\". But hold on there my framework friend, a rewrite is costly and is rarely the correct answer. We'll discuss some common pitfalls when getting a legacy codebase ready for PHP 7 and what we can do to make the upgrade path as painless as possible. These incremental changes will keep the business running while improving security, stability and maintainability of the codebase.","type":"talk","presenter":[{"id":12,"fullname":"Sammy Kaye Powers","twitter":"SammyK","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/5a91d4eb0935b531e2b4a0dbb9a1a432.jpeg","bio":"Sammy Kaye Powers has been making things on the web for fifteen years. Sammy spends the bulk of his time in coffee shops cranking out loads of Facebook apps for ad agencies. He dabbles in PHP internals and is the maintainer of the official Facebook PHP SDK. He loves sharing knowledge about Facebook development & PHP at SammyK.me. He co-organizes the Chicago PHP user group and hosts the PHP Roundtable podcast. He travels all over the States competing in a dance called West Coast Swing. He's also a volunteer magician performing bedside magic at children's hospitals.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Talk","experience_level":"intermediate","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 10:00","end":"2017-09-09 10:45"},{"id":"t8","title":"Does Your Code Measure Up?","abstract":"After days, weeks, or months of coding many developers don't know how to gauge the quality of their code. Adam Culp will introduce tools to grade, benchmark, and analyze PHP code in an automated fashion allowing developers to write better quality software. He will explain key metrics to help understand what may need to be refactored, and use code smells to point out bugs before end-users discover them. Attendees will see how to use these tools, know where to find them, and be able to implement them in their own workflows.","type":"talk","presenter":[{"id":2,"fullname":"Adam Culp","twitter":"adamculp","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/949ae4898f34b986b41e13b4065644db.jpeg","bio":"Adam Culp (@AdamCulp) a Zend consultant at Rogue Wave Software, is passionate about developing with PHP and contributes to many open source projects. He organizes the SunshinePHP Developer Conference and the South Florida PHP Users Group (SoFloPHP) where he enjoys helping others write good code, implement standards, and refactor efficiently. He is a Zend Certified PHP engineer, is a voting member of the PHP-Fig, and holds a seat on the Zend Certification Advisory Board. You can also find him on his Run Geek Radio podcast and GeekyBoy technical blog. When he is not coding or contributing to various developer communities, he can be found hiking around the U.S. National Parks, teaching judo, or long distance (ultra) running.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Talk","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 11:00","end":"2017-09-09 11:45"},{"id":"e14","title":"Lunch Saturday","abstract":"mmmmmmm food for hungry developers. nomnomnom yum.","type":null,"presenter":[],"category":"Sep 09 Sat","session_type":null,"experience_level":null,"room":"Kane Hall","date":"2017-09-09","start":"2017-09-09 12:00","end":"2017-09-09 13:15"},{"id":"t2","title":"UX and UI","abstract":"User Experience and UI Panel","type":"panel","presenter":[{"id":14,"fullname":"Eryn O'Neil","twitter":"eryno","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/c2f1024d95540208df7a17c74e283615.jpeg","bio":"Eryn O’Neil is an independent PHP developer and tech lead based in Minneapolis, MN. Coming from the agency world, she has worked on everything from e-commerce and online promotions to a proprietary framework and CMS. Her philosophy is to build software by placing humans first: both the people who will use it and the developers who will build it with you (and maintain it afterward). \r\n\r\nLiving in Minnesota, Eryn spends most of her free time teaching blues dancing, flying on a trapeze, and wishing it weren’t snowing.","jobtitle":null,"organization":null,"interests":null},{"id":7,"fullname":"Marcia Burrows","twitter":"thelogicalwoman","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/a1216cd9b1196f2d7a1ac9d01f4b9a17.png","bio":"I'm Marcia Burrows. I've been creating learning games for over 40 years.\r\nA former math teacher, I started my programming career with a game published by CBS Software in 1983. \"Math Mileage\" was an award-winning educational game for the 48K Atari Computer written in Assembler for an 8K cartridge.\r\nAfter that I wrote many games and all sorts of code in many languages, including for the Detroit Institute of Arts and Chrysler.\r\nIn 2014 - 2016 I participated in and then served as Community TA for MIT's edX MITx MOOCs \"Introduction to Game Design\" and \"Design and Development of Games for Learning\".\r\nIn the past year I've completed two new projects, one online game and one board game.\r\nlogicalgamestudio.com\r\nNext I’m creating a consortium of indie learning game designers.","jobtitle":null,"organization":null,"interests":null},{"id":13,"fullname":"Beth Tucker Long","twitter":"e3betht","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/d8c917d7661e983b97171d9ec87f78e4.png","bio":"Beth Tucker Long is a PHP developer and co-organizer of (Madison PHP). You can find her on Twitter (@e3betht) or on her blog (http:\/\/www.alittleofboth.com). Beth is a firm believer in promoting community and mentoring. She runs Treeline Design, a web development company, and Playlist Event Music, a DJ company, along with her husband, Chris.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Panel","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 13:30","end":"2017-09-09 14:15"},{"id":"t17","title":"And who would have thought, it FIGures.","abstract":"Wondering what goes on in the Framework Interoperability Group and why PHP Standards Recommendations matter to you? We'll take a look at the process your favorite PHP components use to cooperate with each other towards building consistent, interoperable components. We'll also take a short run through what PSRs already exist and have been widely adopted, and how you can make your voice heard guiding the future of the PHP ecosystem.","type":"talk","presenter":[{"id":9,"fullname":"Sara Golemon","twitter":"SaraMG","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/a243a5c3b3c51fde4371aa685a455017.jpeg","bio":"Sara is a long time contributor to the PHP language and runtime, HHVM Hacker, author of Extending and Embedding PHP, and PHP FIG Core Committee member.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Talk","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 14:30","end":"2017-09-09 15:15"},{"id":"e16","title":"Break Saturday","abstract":"Free time! Refill your coffee. Grab a snack. Visit with vendors, speakers, and attendees. Decompress. Self care time.","type":null,"presenter":[],"category":"Sep 09 Sat","session_type":null,"experience_level":null,"room":"Kane Hall","date":"2017-09-09","start":"2017-09-09 15:15","end":"2017-09-09 15:45"},{"id":"t21","title":"Using PHP and JavaScript to Design a Better Board Game","abstract":"Marcia Burrows is known for creating computer games, but recently her team of two at Goal Quest Games brought a board game from initial inspiration to publication in only 9 months. How? PHP and JavaScript. See how using PHP facilitated long-distance teamwork and helped a weak game develop into a better one. PHP \/ MySql enabled the team to easily coordinate updates to playing cards, and with JavaScript, updated board designs could be generated instantly. These methods allowed rapid prototyping and play-testing cycles. And, with this methodology Goal Quest Games will quickly adapt and publish a recently requested custom version. Attendees will learn the value of the rapid prototyping \/ play-testing cycle in game development as well as how to generate board images for print using JavaScript.","type":"talk","presenter":[{"id":7,"fullname":"Marcia Burrows","twitter":"thelogicalwoman","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/a1216cd9b1196f2d7a1ac9d01f4b9a17.png","bio":"I'm Marcia Burrows. I've been creating learning games for over 40 years.\r\nA former math teacher, I started my programming career with a game published by CBS Software in 1983. \"Math Mileage\" was an award-winning educational game for the 48K Atari Computer written in Assembler for an 8K cartridge.\r\nAfter that I wrote many games and all sorts of code in many languages, including for the Detroit Institute of Arts and Chrysler.\r\nIn 2014 - 2016 I participated in and then served as Community TA for MIT's edX MITx MOOCs \"Introduction to Game Design\" and \"Design and Development of Games for Learning\".\r\nIn the past year I've completed two new projects, one online game and one board game.\r\nlogicalgamestudio.com\r\nNext I’m creating a consortium of indie learning game designers.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Talk","experience_level":"beginner","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 15:45","end":"2017-09-09 16:30"},{"id":"t19","title":"More Than Just a Hammer","abstract":"Learn to expand beyond just PHP to integrate other languages into both your personal skill set and the solutions you deliver. In this talk we'll cover integrating JavaScript (frontend and backend via node) and how you can expand your current skill set to include this or any other language alongside PHP. The old saying, if all you have is a hammer everything looks like a nail, is very true so let's learn how to use a wrench and maybe a chainsaw! Not only will this give you another tool in your tool belt, it will give you a greater understanding of development practices and the ability to on new jobs, new projects, and new challenges.","type":"talk","presenter":[{"id":5,"fullname":"Ben Edmunds","twitter":"benedmunds","picture":"http:\/\/www.pnwphp.com\/storage\/speakers\/72b23620824c727d6c543c60605bac1b.jpeg","bio":"CTO of an awesome company you've never heard of by day, hacking on crazy ideas by night. PHP Town Hall podcast co-host. Author of Securing PHP Apps. Conference speaker. Open source advocate. Human.","jobtitle":null,"organization":null,"interests":null}],"category":"Sep 09 Sat","session_type":"Talk","experience_level":"intermediate","room":"Kane Hall room 220","date":"2017-09-09","start":"2017-09-09 16:45","end":"2017-09-09 17:30"},{"id":"e17","title":"Closing Saturday","abstract":"Tessa wraps up the main event with announcements, thank yous, and mostly a bunch of awesome gifts and prizes to give away!","type":null,"presenter":[],"category":"Sep 09 Sat","session_type":null,"experience_level":null,"room":"Main Event Room @ Kane Hall","date":"2017-09-09","start":"2017-09-09 17:30","end":"2017-09-09 18:30"}]